app/controllers/admin/pages_controller.rb

    def new
      @page = Page.new type: Type.where(name: params[:type]).first
      @page.type.field_definitions.each do |definition|
---
SELECT  "types".* FROM "types" WHERE "types"."name" = ?  ORDER BY "types"."id" ASC LIMIT 1  [["name", "Image"]]
SELECT "field_definitions".* FROM "field_definitions" WHERE "field_definitions"."type_id" = ?  [["type_id", 1]]
SELECT "pages".* FROM "pages" WHERE (NOT (slug))

    def create
      @page = Page.new(page_params)

      respond_to do |format|
        if @page.save
---
INSERT INTO "pages" ("type_id", "title", "body", "slug", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def update
      respond_to do |format|
        if @page.update(page_params)
---
UPDATE "pages" SET "title" = ?, "body" = ?, "category_id" = ?, "updated_at" = ? WHERE "pages"."id" = ?  [["title", "<p>Demo page</p>\r\n"], ["body", "<p>Hello!</p>\r\n"], ["category_id", 2], ["updated_at", "2016-01-18 13:56:12.724358"], ["id", 10]]